app/Http/Controllers/PageController.php

    public function home(Request $request)
    {
        $search = $request->get('search');

        $posts = Post::where('title', 'LIKE', "%{$search}%")
            ->with('user')
            ->latest()->paginate(15);
---
select * from `posts` where `title` LIKE '%deleniti%' order by `created_at` desc limit 15 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `posts` where `title` LIKE '%deleniti%'