app/Http/Controllers/PostController.php

    public function index()
    {
        return view('posts.index', [
            'posts' => Post::latest()->paginate(15)
        ]);
---
select * from `posts` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `posts`

    public function destroy(Post $post)
    {
        $post->delete();
---
delete from `posts` where `id` = 85